
Analyze different techniques for Data normalization in the given dataset

In [39]:
#import all the required packages
import numpy as np
import pandas as pd

In [40]:
ds=pd.read_csv("C:/Users/P.SUJAYA RAGHAVI/Downloads/datasets/advertising.csv")

In [41]:
ds

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

# MIN - MAX NORMALIZATION

In [42]:
#v'=((vi-min_A)/(max_A)-min_A))(new max_A- new min_A)+new min_A

In [43]:
#finding min and max values of TV advertising
min_A=ds['TV'].min()

In [44]:
min_A

0.7

In [45]:
max_A=ds['TV'].max()

In [46]:
max_A

296.4

In [51]:
ds[['TV']].head(10)

         TV
0  0.775786
1  0.148123
2  0.055800
3  0.509976
4  0.609063
5  0.027054
6  0.192087
7  0.404126
8  0.026716
9  0.673318

In [52]:
#transforming the data values of TV using the formula
#new range(0,1)
ds['TV']=((ds['TV']-min_A)/(max_A-min_A))*(1-0)+0

In [53]:
#new values of TV after normalization
ds[['TV']].head(10)

         TV
0  0.000256
1 -0.001866
2 -0.002179
3 -0.000643
4 -0.000308
5 -0.002276
6 -0.001718
7 -0.001001
8 -0.002277
9 -0.000090

# Z-SCORE NORMALIZATION

In [54]:
#v'=vi-mean/S.D

In [58]:
#calculating the mean of Radio data values
mean=ds['Radio'].mean()
print(mean)

23.264000000000006

In [59]:
#calculating the standard deviation
sd=ds['Radio'].std()
print(sd)

14.846809176168723

In [60]:
#Radio data values
ds[['Radio']].head(10)

   Radio
0   37.8
1   39.3
2   45.9
3   41.3
4   10.8
5   48.9
6   32.8
7   19.6
8    2.1
9    2.6

In [61]:
#transforming Radio values
ds['Radio']=(ds['Radio']-mean)/sd

In [62]:
#normalized values of Radio data
ds[['Radio']].head(10)

      Radio
0  0.979066
1  1.080097
2  1.524637
3  1.214806
4 -0.839507
5  1.726701
6  0.642293
7 -0.246787
8 -1.425491
9 -1.391814

# DECIMAL SCALING

In [63]:
#v'=vi/10^j

In [64]:
import math

In [65]:
ds[['Newspaper']].head(10)

   Newspaper
0       69.2
1       45.1
2       69.3
3       58.5
4       58.4
5       75.0
6       23.5
7       11.6
8        1.0
9       21.2

In [66]:
#finding the maximum absolute value
val=int(max(abs(ds['Newspaper'])))
print(val)

114

In [69]:
#calculate the scaling factor j using max abs value
j=int(math.log(val)/math.log(10))+1
print(j)

3

In [70]:
ds['Newspaper']=ds['Newspaper']/10**j

In [71]:
#normalized  values
ds[['Newspaper']].head(10)

   Newspaper
0     0.0692
1     0.0451
2     0.0693
3     0.0585
4     0.0584
5     0.0750
6     0.0235
7     0.0116
8     0.0010
9     0.0212